package com.cafe24.dk4750.miniMarket.controller;


public class CompanyController {
	//@Autowired private CompanyService companyService; 
	
	//업체 탈퇴 폼  
	
	//업체 탈퇴 액션 
	
	//비밀번호 찾기 액션 
	
	//비밀번호 찾기 폼 
	
	//업체 아이디 찾기 액션
	
	//업체 아이디 찾기 폼 
	
	//업체 정보 수정(비밀번호 수정)폼  
	
	//업체 정보 수정(비밀번호 수정)액션  
	
	//업체 정보 수정(이름,전화번호,내동네 )폼
	
	//업체 정보(이름,전화번호,내동네 ) 수정 액션
	
	//마이페이지 
	
	//업체 사진,닉네임 수정 폼
	
	//업체 사진, 닉네임만 수저폼 수정 액션
		
	//로그아웃하기
	
	//로그인 폼 	
	
	//로그인 액션 
		
	//회원가입  폼
		
	//회원가입(이메일 인증 서비스도 포함)
		
	//나의 업체 정보보기
	
	//업체 가입(이메일 인증 서비스도 포함)
	
	
}
